Поработаем с данными о поездках на такси в Нью-Йорке, где также имеется информация о погодных условиях и выходных днях.  

* pickup_dt – период с точностью до часа
* pickup_month – месяц
* borough – район Нью-Йорка, из которого был сделан заказ (5 районов + аэропорт)
* pickups – число поездок за период (час)
* hday – является ли день праздничным/выходным; Y - да,  N - нет
* spd – скорость ветра в милях в час
* vsb – видимость
* temp – температура в градусах Фаренгейта
* dewp – точка росы по Фаренгейту
* slp – давление
* pcp_01 – количество осадков за час
* pcp_06 – количество осадков за 6 часов
* pcp_24 – количество осадков за 24 часа
* sd – глубина снега в дюймах

Импортируем библиотеку pandas

In [62]:
import pandas as pd

Запишем путь к файлу

In [63]:
path_to_file_t = 'https://raw.githubusercontent.com/Vlkoz/base_pandas/main/files/2_taxi_nyc.csv'

Считаем файл и запишем df в переменную taxi

In [64]:
taxi = pd.read_csv(path_to_file_t)

In [65]:
taxi

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp 01,pcp 06,pcp 24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

#### 1. В названиях столбцов pcp 01, pcp 06, pcp 24 встречается пробел. Это не очень удобно, если в дальнейшем вы планируете обращаться к колонкам через точку, без использования кавычек и скобочек. 

#### Замените пробел в названиях на знак нижнего подчеркивания. 

Данные сохранены в переменную taxi. Данные должны быть изменены в этом же датафрейме.

Заменим название колонок, перезапишем новый df в переменную

In [66]:
taxi = taxi.rename (columns = {'pcp 01': 'pcp_01', 'pcp 06': 'pcp_06', 'pcp 24': 'pcp_24'})

#### 2. Вас попросили узнать, сколько записей (строк) в датафрейме относятся к району Манхэттен (Manhattan). Получить ответ на данный вопрос можно было бы, например, с помощью следующей команды:

taxi.query("borough == 'Manhattan'").shape[0]

А если мы хотим посмотреть, сколько раз встречается каждый из районов? Неужели придется использовать подобную конструкцию для каждого уровня переменной? Здесь на помощь приходит метод value_counts(). 

#### Сколько раз в данных встречается район Бруклин (Brooklyn)?

Посчитаем сколько раз встречается тот или иной район

In [67]:
taxi.borough.value_counts()

Bronx            4343
Brooklyn         4343
Manhattan        4343
EWR              4343
Queens           4343
Staten Island    4343
Name: borough, dtype: int64

#### 3. Следующая задача: выяснить, из какого района было совершено наибольшее количество поездок за весь период. Для начала, посчитайте общее количество поездок (pickups), без группировки.

Посчитаем общее количество поездок

In [68]:
taxi.pickups.sum()

14265773

#### А теперь сгруппируйте данные по району (borough) и укажите, из какого пункта было совершено больше всего поездок.

Сгруппируем по району и посчитаем количество поездок по каждому району. Отсортируем по убыванию

In [69]:
taxi.groupby('borough', as_index = False) \
    .agg({'pickups': 'sum'}) \
    .sort_values('pickups', ascending = False)

         borough   pickups
3      Manhattan  10367841
1       Brooklyn   2321035
4         Queens   1343528
0          Bronx    220047
5  Staten Island      6957
2            EWR       105

#### 4. ⭐️Задание со звёздочкой!⭐️

Еще несколько полезных методов в pandas! Возможно, в предыдущем степе вы просто посмотрели на данные или отсортировали значения. Ускорить данный процесс в дальнейшем помогут методы idxmin() и idxmax(), которые возвращают индекс минимального или максимального значения.

idxmin – индекс минимального значения
idxmax – индекс максимального значения
#### Сохраните название района с наименьшим числом поездок в переменную min_pickups, применив подходящий метод.

Скопируем часть кода из прошлого задания, применим метод idxmin()

In [70]:
min_pickups =taxi.groupby('borough') \
    .agg({'pickups': 'sum'}) \
    .idxmin()

In [71]:
min_pickups

pickups    EWR
dtype: object

#### 5. Продолжим изучение данных и посмотрим на число поездок в выходные дни. Сгруппируйте данные по двум признакам: району города и является ли день выходным (колонки borough и hday). Сравните среднее число поездок, и выберите районы, из которых по праздникам в среднем поступает больше заказов, чем в обычные дни.

Сгруппируем по району и дню недели и сагрегируем по среднему

In [72]:
taxi.groupby(['borough', 'hday']).agg({'pickups': 'mean'})

                        pickups
borough       hday
Bronx         N       50.771073
              Y       48.065868
Brooklyn      N      534.727969
              Y      527.011976
EWR           N        0.023467
              Y        0.041916
Manhattan     N     2401.302921
              Y     2035.928144
Queens        N      308.899904
              Y      320.730539
Staten Island N        1.606082
              Y        1.497006

#### 6. Для каждого района посчитайте число поездок по месяцам. Отсортируйте полученные значения по убыванию и сохраните результирующий датафрейм в pickups_by_mon_bor.

Обратите внимание, что итоговый датасет должен состоять из 3-х колонок - pickup_month, borough, pickups.

Сгруппируем по району и месяцу, сагрегируем по сумме поездок и отсортируем в порядке убывания. Всё это запишем в переменную pickups_by_mon_bor

In [73]:
pickups_by_mon_bor = taxi.groupby(['borough', 'pickup_month'], as_index = False) \
    .agg({'pickups': 'sum'}) \
    .sort_values('pickups', ascending = False)

In [74]:
taxi

,pickup_dt,pickup_month,borough,pickups,hday,spd,vsb,temp,dewp,slp,pcp_01,pcp_06,pcp_24,sd
0,2015-01-01 01:00:00,Jan,Bronx,152,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
1,2015-01-01 01:00:00,Jan,Brooklyn,1519,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
2,2015-01-01 01:00:00,Jan,EWR,0,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
3,2015-01-01 01:00:00,Jan,Manhattan,5258,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
4,2015-01-01 01:00:00,Jan,Queens,405,Y,5.0,10.0,30.0,7.0,1023.5,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29096,2015-06-30 23:00:00,Jun,EWR,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29097,2015-06-30 23:00:00,Jun,Manhattan,3828,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29098,2015-06-30 23:00:00,Jun,Queens,580,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29099,2015-06-30 23:00:00,Jun,Staten Island,0,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0
29100,2015-06-30 23:00:00,Jun,NaN,3,N,7.0,10.0,75.0,65.0,1011.8,0.0,0.0,0.0,0.0

#### 7. 💀 Сложное задание! 💀

#### Теперь задача посложнее! Попрактикуемся в написании собственных функций и их применении к датафрейму. Поскольку данные о поездках в Нью-Йорке, температура представлена в градусах Фаренгейта. 

#### Напишите функцию temp_to_celcius, которая получает на вход колонку с температурой в °F, и возвращает значения, переведенные в градусы Цельсия.

Формула:

 Celsius = \frac{(Fahrenheit-32) \cdot 5.0}{9.0}Celsius= 
9.0
(Fahrenheit−32)⋅5.0
​
 

Пример работы функции:

> taxi['temp'][:5]

0    30.0
1    30.0
2    30.0
3    30.0
4    30.0

> taxi['temp_C'] = temp_to_celcius(taxi['temp'])
> taxi['temp_C'][:5]

0   -1.111111
1   -1.111111
2   -1.111111
3   -1.111111
4   -1.111111

Запишем колонку с градусами Фаренгейта в переменную temp_f

In [75]:
temp_f = taxi.temp

Напишем функцию, которая будет переводить в градусы Цельсия

In [76]:
def temp_to_celcius (temp_f):
    temp_to_celcius = ((taxi.temp-32)*5)/9
    return temp_to_celcius

In [77]:
temp_to_celcius(temp_f)

0        -1.111111
1        -1.111111
2        -1.111111
3        -1.111111
4        -1.111111
           ...
29096    23.888889
29097    23.888889
29098    23.888889
29099    23.888889
29100    23.888889
Name: temp, Length: 29101, dtype: float64

#### 8. Прочитайте датасет bookings.csv с разделителем ;.

#### Сохраните прочитанный датасет в bookings.

#### Затем запишите первые 7 строк в переменную bookings_head.

Запишем путь в переменную path_to_file_b

In [78]:
path_to_file_b = 'https://raw.githubusercontent.com/Vlkoz/base_pandas/main/files/bookings.csv'

Прочитаем файл и запишем его в переменную bookings

In [79]:
bookings= pd.read_csv(path_to_file_b, sep = ';')

Запишем первые 7 строк в переменную bookings_head

In [80]:
bookings_head = bookings.head(7)

#### 9. Посмотрите на размеры таблицы. Сколько всего в ней столбцов?

In [81]:
bookings.dtypes

Hotel                         object
Is Canceled                    int64
Lead Time                      int64
arrival full date             object
Arrival Date Year              int64
Arrival Date Month            object
Arrival Date Week Number       int64
Arrival Date Day of Month      int64
Stays in Weekend nights        int64
Stays in week nights           int64
stays total nights             int64
Adults                         int64
Children                     float64
Babies                         int64
Meal                          object
Country                       object
Reserved Room Type            object
Assigned room type            object
customer type                 object
Reservation Status            object
Reservation status_date       object
dtype: object

#### 10.💀 Сложное задание! 💀

#### Как вы уже могли заметить, при сборе датасета произошла небольшая ошибка, и названия колонок были записаны в неудобном для дальнейшей работы формате. Исправьте ситуацию, приведя названия столбцов к нижнему регистру и заменив пробелы на знак нижнего подчеркивания. 
Например: Is Canceled -> is_canceled

Могут пригодиться: 

rename
str.lower
str.replace
columns
Данные уже сохранены в bookings.

С помощью строковых методов заменим пробелы на знак "_", а также заменим заглавные буквы на буквы нижнего регистра

In [82]:
bookings.columns = bookings.columns.str.replace (" ", "_").str.lower()

#### 11. 💀 Сложное задание! 💀
#### Перейдем к исследованию данных! Пользователи из каких стран совершили наибольшее число успешных бронирований? Бронирование считается успешным, если в дальнейшем не было отменено (переменная is_canceled). В качестве ответа выберите страны, входящие в топ-5.

Отберём только те заказы, которые не были отменены

Сгруппируем по стране, выключим индексирование

Посчитаем количество по любой из колонок

Отсортируем по убыванию колонку hotel

Выведем топ 5 строк

In [83]:
bookings.query("is_canceled == 0") \
    .groupby('country', as_index=False) \
    .agg({'hotel': 'count'}) \
    .sort_values ('hotel', ascending = False) \
    .head()

    country  hotel
125     PRT  21071
57      GBR   9676
54      FRA   8481
50      ESP   6391
42      DEU   6069

#### 12. На сколько ночей (stays_total_nights)  в среднем бронируют отели типа City Hotel? Resort Hotel? Запишите полученные значения в пропуски с точностью до 2 знаков после точки.

Сгруппируем по типу отеля

Сагрегируем по среднему количеству ночей

Округлим до двух знаков после запятой

In [84]:
bookings.groupby('hotel') \
    .agg({'stays_total_nights': 'mean'}) \
    .round(2)

              stays_total_nights
hotel
City Hotel                  2.98
Resort Hotel                4.32

#### 13. Иногда тип номера, присвоенного клиенту (assigned_room_type), отличается от изначально забронированного (reserved_room_type). Такое может произойти, например, по причине овербукинга.

#### Сколько подобных наблюдений встретилось в датасете?

*отмена бронирования также считается

Отберём строки, где reserved_room_type не равняется assigned_room_type

С помощью атрибута shape посчитаем количество получившихся строк

In [85]:
bookings.query("reserved_room_type != assigned_room_type") \
    .shape

(14917, 21)

#### 14. Теперь проанализируйте даты запланированного прибытия (arrival_date_year).

#### На какой месяц чаще всего оформляли бронь в 2016 году? Изменился ли самый популярный месяц в 2017?

Отсортируем по году

Сгруппируем по месяцу, выключим индекс

Посчитаем количество броней

Отсортируем количество по убыванию

Переименуем колонку 'lead_time' в более подходящую по названию 'amount'

In [86]:
bookings.query ('arrival_date_year == 2016') \
    .groupby('arrival_date_month', as_index = False) \
    .agg({'lead_time':'count'}) \
    .sort_values('lead_time', ascending = False) \
    .rename (columns ={'lead_time': 'amount'})

   arrival_date_month  amount
10            October    6203
8                 May    5478
0               April    5428
11          September    5394
6                June    5292
1              August    5063
7               March    4824
5                July    4572
9            November    4454
3            February    3891
2            December    3860
4             January    2248

Аналогичные действия произведём с 2017 годом

In [87]:
bookings.query ('arrival_date_year == 2017') \
    .groupby('arrival_date_month', as_index = False) \
    .agg({'lead_time':'count'}) \
    .sort_values('lead_time', ascending = False) \
    .rename (columns ={'lead_time': 'amount'})

  arrival_date_month  amount
7                May    6313
0              April    5661
5               June    5647
4               July    5313
6              March    4970
1             August    4925
2           February    4177
3            January    3681

#### 15. Сгруппируйте данные по годам, а затем проверьте, на какой месяц (arrival_date_month) бронирования отеля типа City Hotel отменялись чаще всего в 2015? 2016? 2017? 

Hint: для этого сначала примените метод groupby, после чего выберите нужную колонку для дальнейших действий :)
Например:

df.groupby('column_1')['column_2'].what_to_do()

Сделаем отбор по типу отеля City Hotel и по отменённым заказам

Сгруппируем по году и месяцу

Посчитаем количество отмен

Отсортируем по убыванию по году и по количеству отмен

In [88]:
bookings.query("hotel == 'City Hotel' and is_canceled ==1") \
    .groupby(['arrival_date_year', 'arrival_date_month']) \
    .agg({'is_canceled': 'sum'}) \
    .sort_values(['arrival_date_year', 'is_canceled'], ascending = False)

                                      is_canceled
arrival_date_year arrival_date_month
2017              May                        2217
                  April                      1926
                  June                       1808
                  July                       1324
                  March                      1278
                  August                     1123
                  January                    1044
                  February                    971
2016              October                    1947
                  June                       1720
                  September                  1567
                  April                      1539
                  May                        1436
                  November                   1360
                  August                     1247
                  March                      1108
                  December                   1072
                  July                       1043
                  February                    930
                  January                     438
2015              September                  1543
                  October                    1321
                  August                     1232
                  July                        939
                  December                    668
                  November                    301

#### 16. Посмотрите на числовые характеристики трёх колонок: adults, children и babies. Какая из них имеет наибольшее среднее значение?

Воспользовавшись атрибутом mean посчитаем среднее значение по каждой колонке

In [89]:
bookings.adults.mean()

1.8564033838679956

In [90]:
bookings.children.mean()

0.10388990333874994

In [91]:
bookings.babies.mean()

0.007948739425412514

#### 17. Создайте колонку total_kids, объединив столбцы children и babies. Для отелей какого типа среднее значение переменной оказалось наибольшим?

City hotel – отель находится в городе
Resort hotel – отель курортный
В качестве ответа укажите наибольшее среднее total_kids, округлив до 2 знаков после точки.

Добавим новую колонку 'total kids', которая совместит в себе две колонки

In [92]:
bookings['total_kids'] = bookings.children + bookings.babies

Сгруппируем по отелю и посчитаем среднее по колонке 'total_kids'

Округлим до 3 знаков до запятой

In [93]:
bookings.groupby('hotel') \
    .agg({'total_kids': 'mean'}) \
    .round(2)

              total_kids
hotel
City Hotel          0.10
Resort Hotel        0.14

#### 18. 💀 Сложное задание! 💀

Не все бронирования завершились успешно (is_canceled), поэтому можно посчитать, сколько клиентов было потеряно в процессе. Иными словами, посчитать метрику под названием Churn Rate.

Churn rate (отток, коэффициент оттока) – это процент подписчиков (например, на push-уведомления от сайта), которые отписались от канала коммуникации, отказались от услуг сервиса в течение определенного периода времени. Иными словами, представляет собой отношение количества ушедших пользователей к общему количеству пользователей, выраженное в процентах.

В нашем случае Churn Rate - это процент клиентов, которые отменили бронирование. Давайте посмотрим, как эта метрика связана с наличием детей у клиентов!

#### Создайте переменную has_kids, которая принимает значение True, если клиент при бронировании указал хотя бы одного ребенка (total_kids), в противном случае – False. Далее проверьте, среди какой группы пользователей показатель оттока выше. 

В качестве ответа укажите наибольший % оттока, округленный до 2 знаков после точки (то есть доля 0.24563 будет 24.56% и в ответ пойдёт 24.56)

Отберём отменённые бронирования с детьми

Посмотрим на количество получившихся строк

In [94]:
has_kids_cancel = bookings.query("is_canceled > 0 and total_kids > 0").shape[0]

Посмотрим на общее количество заказов с детьми

In [95]:
has_kids = bookings.query("total_kids > 0").shape[0]

Рассчитаем процент оттока для людей с детьми

In [96]:
churn_rate_kids = has_kids_cancel/has_kids * 100

Округлим получившееся значение до 2 знаков до запятой

In [97]:
churn_rate_kids = round(churn_rate_kids,2)

Отберём отменённые бронирования без детей

Посмотрим на количество получившихся строк

In [98]:
no_kids_cancel = bookings.query("is_canceled > 0 and total_kids == 0").shape[0]

Посмотрим на общее количество заказов без детей

In [99]:
no_kids = bookings.query("total_kids == 0").shape[0]

Рассчитаем процент оттока для людей без детей

In [100]:
churn_rate_no_kids = no_kids_cancel/no_kids*100

Округлим получившееся значение до 2 знаков до запятой

In [101]:
churn_rate_no_kids= round(churn_rate_no_kids,2)

In [102]:
churn_rate_kids

34.92

In [103]:
churn_rate_no_kids

37.22